---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.HasSpatialElementCalculationPoint
zh: 族实例
source: html/eb1b4c8b-8b8a-1247-4150-b5d55231363b.htm
---
# Autodesk.Revit.DB.FamilyInstance.HasSpatialElementCalculationPoint Property

**中文**: 族实例

Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space.

## Syntax (C#)
```csharp
public bool HasSpatialElementCalculationPoint { get; }
```

## Returns
True if this instance has a single SpatialElementCalculationPoint used as the search point, false otherwise.